<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Working With Time Series Data

---

### Learning Objectives
 
**After this lesson, you will be able to:**
- Identify time series data.
- Explain the challenges of working with time series data.
- Use the `datetime` library to represent dates as objects.
- Preprocess time series data with Pandas.

---

<h2><a id="A">What is a Time Series?</a></h2>

A **time series** is a series of data points that's indexed (or listed, or graphed) in time order. Most commonly, a time series is a sequence that's taken at successive equally spaced points in time. Time series are often represented as a set of observations that have a time-bound relation, which is represented as an index.

Time series are commonly found in sales, analysis, stock market trends, economic phenomena, and social science problems.

These data sets are often investigated to evaluate the long-term trends, forecast the future, or perform some other form of analysis.

### Let's take a look at some Apple stock data to get a feel for what time series data look like.

In [1]:
import pandas as pd
from datetime import timedelta
%matplotlib inline

aapl = pd.read_csv("data/aapl.csv")

Take a high-level look at the data. What are we looking at?

In [2]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0  13-Jan-17  119.11  119.62  118.81  119.04  26111948
1  12-Jan-17  118.90  119.30  118.21  119.25  27086220
2  11-Jan-17  118.74  119.93  118.60  119.75  27588593
3  10-Jan-17  118.77  119.38  118.30  119.11  24462051
4   9-Jan-17  117.95  119.43  117.94  118.99  33561948

In [3]:
aapl.describe()

             Open        High         Low       Close        Volume
count  251.000000  251.000000  251.000000  251.000000  2.510000e+02
mean   105.155100  106.060518  104.392550  105.292191  3.674495e+07
std      7.905047    7.876708    7.995679    7.963102  1.609059e+07
min     90.000000   91.670000   89.470000   90.340000  1.147592e+07
25%     97.355000   98.220000   96.690000   97.340000  2.665144e+07
50%    106.270000  107.270000  105.500000  106.100000  3.229234e+07
75%    111.450000  112.370000  110.700000  111.750000  4.137394e+07
max    119.110000  119.930000  118.810000  119.750000  1.322245e+08

<h2><a id="B">The DateTime library</a></h2>

As time is important to time series data, we will need to interpret these data in the ways that humans interpret them (which is many ways). 

Python's `DateTime` library is great for dealing with time-related data, and Pandas has incorporated this library into its own `datetime` series and objects.

In this lesson, we'll review these data types and learn a little more about each of them:

* `datetime` objects.
* `datetime` series.
* Timestamps.
* `timedelta()`.

### `datetime` Objects

Below, we'll load in the `DateTime` library, which we can use to create a `datetime` object by entering in the different components of the date as arguments.

In [4]:
# The datetime library is something you should already have from Anaconda.
from datetime import datetime

In [5]:
# Let's just set a random datetime â€” not the end of the world or anything.
lesson_date = datetime(2012, 12, 21, 12, 21, 12, 844089)

The components of the date are accessible via the object's attributes.

In [6]:
print("Micro-Second", lesson_date.microsecond)
print("Second", lesson_date.second)
print("Minute", lesson_date.minute)
print("Hour", lesson_date.hour)
print("Day", lesson_date.day)
print("Month",lesson_date.month)
print("Year", lesson_date.year)

Micro-Second 844089
Second 12
Minute 21
Hour 12
Day 21
Month 12
Year 2012

### `timedelta()`

Suppose we want to add time to or subtract time from a date. Maybe we're using time as an index and want to get everything that happened a week before a specific observation.

We can use a `timedelta` object to shift a `datetime` object. Here's an example:

In [7]:
# Import timedelta() from the DateTime library.
from datetime import timedelta

# Timedeltas represent time as an amount rather than as a fixed position.
offset = timedelta(days=1, seconds=20)

# The timedelta() has attributes that allow us to extract values from it.
print('offset days', offset.days)
print('offset seconds', offset.seconds)
print('offset microseconds', offset.microseconds)

offset days 1
offset seconds 20
offset microseconds 0

`datetime`'s `.now()` function will give you the `datetime` object of this very moment.

In [8]:
now = datetime.now()
print("Like Right Now: ", now)

Like Right Now:  2018-08-08 18:35:49.871081

The current time is particularly useful when using `timedelta()`.

In [9]:
print("Future: ", now + offset)
print("Past: ", now - offset)

Future:  2018-08-09 18:36:09.871081
Past:  2018-08-07 18:35:29.871081

*Note: The largest value a `timedelta()` can hold is days. For instance, you can't say you want your offset to be two years, 44 days, and 12 hours; you have to convert those years to days.*

You can read more about the `timedelta()` category [here](https://docs.python.org/2/library/datetime.html).

### Guided Practice: Apple Stock Data

We can practice using `datetime` functions and objects using Apple stock data.

In [10]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0  13-Jan-17  119.11  119.62  118.81  119.04  26111948
1  12-Jan-17  118.90  119.30  118.21  119.25  27086220
2  11-Jan-17  118.74  119.93  118.60  119.75  27588593
3  10-Jan-17  118.77  119.38  118.30  119.11  24462051
4   9-Jan-17  117.95  119.43  117.94  118.99  33561948

The `Date` column starts off as an object.

In [11]:
aapl.dtypes

Date       object
Open      float64
High      float64
Low       float64
Close     float64
Volume      int64
dtype: object

<h2><a id="C">Preprocessing Time Series Data with Pandas</a><h2>

### Convert time data to a `datetime` object.

Overwrite the original `Date` column with one that's been converted to a `datetime` series.

In [12]:
aapl['Date'] = pd.to_datetime(aapl.Date)

We can see these changes reflected in the `Date` column structure.

In [13]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0 2017-01-13  119.11  119.62  118.81  119.04  26111948
1 2017-01-12  118.90  119.30  118.21  119.25  27086220
2 2017-01-11  118.74  119.93  118.60  119.75  27588593
3 2017-01-10  118.77  119.38  118.30  119.11  24462051
4 2017-01-09  117.95  119.43  117.94  118.99  33561948

We can also see that the `Date` object has changed.

In [14]:
aapl.dtypes

Date      datetime64[ns]
Open             float64
High             float64
Low              float64
Close            float64
Volume             int64
dtype: object

### The `.dt` Attribute

Pandas' `datetime` columns have a `.dt` attribute that allows you to access attributes that are specific to dates. For example:

    aapl.Date.dt.day
    aapl.Date.dt.month
    aapl.Date.dt.year
    aapl.Date.dt.weekday_name

And, there are many more!

In [15]:
aapl.Date.dt.weekday_name.head()

0       Friday
1     Thursday
2    Wednesday
3      Tuesday
4       Monday
Name: Date, dtype: object

In [16]:
aapl.Date.dt.dayofyear.head()

0    13
1    12
2    11
3    10
4     9
Name: Date, dtype: int64

Check out the Pandas `.dt` [documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.dt.html) for more information.

### Timestamps

Timestamps are useful objects for comparisons. You can create a timestamp object using the `pd.to_datetime()` function and a string specifying the date. These objects are especially helpful when you need to perform logical filtering with dates.

In [17]:
ts = pd.to_datetime('1/1/2017')
ts

Timestamp('2017-01-01 00:00:00')

The main difference between a `datetime` object and a timestamp is that timestamps can be used as comparisons.

Let's use the timestamp `ts` as a comparison with our Apple stock data.

In [18]:
aapl.loc[aapl.Date >= ts, :].head()

        Date    Open    High     Low   Close    Volume
0 2017-01-13  119.11  119.62  118.81  119.04  26111948
1 2017-01-12  118.90  119.30  118.21  119.25  27086220
2 2017-01-11  118.74  119.93  118.60  119.75  27588593
3 2017-01-10  118.77  119.38  118.30  119.11  24462051
4 2017-01-09  117.95  119.43  117.94  118.99  33561948

We can even get the first and last dates from a time series.

In [19]:
aapl.Date.max() - aapl.Date.min()

Timedelta('360 days 00:00:00')

> **Check for Understanding:** Why do we convert the DataFrame column containing the time information into a `datetime` object?

### Set `datetime` to Index the DataFrame

After converting the column containing time data from object to `datetime`, it is also useful to make the index of the DataFrame a `datetime`.

In [20]:
aapl.head()

        Date    Open    High     Low   Close    Volume
0 2017-01-13  119.11  119.62  118.81  119.04  26111948
1 2017-01-12  118.90  119.30  118.21  119.25  27086220
2 2017-01-11  118.74  119.93  118.60  119.75  27588593
3 2017-01-10  118.77  119.38  118.30  119.11  24462051
4 2017-01-09  117.95  119.43  117.94  118.99  33561948

Let's set the `Date` column as the index.

In [21]:
aapl.set_index('Date', inplace=True)

In [22]:
aapl.head()

              Open    High     Low   Close    Volume
Date
2017-01-13  119.11  119.62  118.81  119.04  26111948
2017-01-12  118.90  119.30  118.21  119.25  27086220
2017-01-11  118.74  119.93  118.60  119.75  27588593
2017-01-10  118.77  119.38  118.30  119.11  24462051
2017-01-09  117.95  119.43  117.94  118.99  33561948

### Filtering by Date with Pandas

It is easy to filter by date using Pandas. Let's create a subset of data containing only the stock prices from 2017. We can specify the index as a string constant.

In [23]:
aapl['2017']

              Open    High     Low   Close    Volume
Date
2017-01-13  119.11  119.62  118.81  119.04  26111948
2017-01-12  118.90  119.30  118.21  119.25  27086220
2017-01-11  118.74  119.93  118.60  119.75  27588593
2017-01-10  118.77  119.38  118.30  119.11  24462051
2017-01-09  117.95  119.43  117.94  118.99  33561948
2017-01-06  116.78  118.16  116.47  117.91  31751900
2017-01-05  115.92  116.86  115.81  116.61  22193587
2017-01-04  115.85  116.51  115.75  116.02  21118116
2017-01-03  115.80  116.33  114.76  116.15  28781865

There are a few things to note about indexing with time series. Unlike numeric indexing, the end index will be included. If you want to index with a range, the time indices must be sorted first.

> **Recap:** The steps for preprocessing time series data are to:
* Convert time data to a `datetime` object.
* Set `datetime` to index the DataFrame.

# Recap

* We use time series analysis to identify changes in values over time.
* The `datetime` library makes working with time data more convenient.
* To preprocess time series data with Pandas, you:
    1. Convert the time column to a `datetime` object.
    2. Set the time column as the index of the DataFrame.

<h2><a id="D">Independent Practice</a></h2>

**Instructor Note**: These are optional and can be assigned as student practice questions outside of class.

### 1) Create a `datetime` object representing today's date.

In [24]:
kick = pd.read_csv('data/ks-projects.csv.zip', compression='zip', encoding='Windows-1252')

/Users/sankokohtet/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2728: DtypeWarning: Columns (13,14,15) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [25]:
kick.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 323750 entries, 0 to 323749
Data columns (total 17 columns):
ID                323750 non-null int64
name              323746 non-null object
category          323745 non-null object
main_category     323750 non-null object
currency          323750 non-null object
deadline          323750 non-null object
goal              323750 non-null object
launched          323750 non-null object
pledged           323750 non-null object
state             323750 non-null object
backers           323750 non-null object
country           323750 non-null object
usd pledged       319960 non-null object
Unnamed: 13       625 non-null object
Unnamed: 14       12 non-null object
Unnamed: 15       4 non-null object
Unnamed: 16       1 non-null float64
dtypes: float64(1), int64(1), object(15)
memory usage: 42.0+ MB

In [26]:
kick.columns

Index(['ID ', 'name ', 'category ', 'main_category ', 'currency ', 'deadline ',
       'goal ', 'launched ', 'pledged ', 'state ', 'backers ', 'country ',
       'usd pledged ', 'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15',
       'Unnamed: 16'],
      dtype='object')

In [27]:
kick.columns = ['id', 'name', 'category', 'main_category', 'currency', 'deadline', 'goal', 'launched', 'pledged', 'state',
               'backers', 'country', 'usd_pledged', 'unm_1', 'unm_2', 'unm_3', 'unm_4']

In [28]:
kick.launched.head()

0    2015-08-11 12:12:28
1    2013-01-12 00:20:50
2    2012-03-17 03:24:11
3    2015-07-04 08:35:03
4    2016-02-26 13:38:27
Name: launched, dtype: object

In [29]:
kick['launched'] = pd.to_datetime(kick.launched, errors='coerce')

In [30]:
kick.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 323750 entries, 0 to 323749
Data columns (total 17 columns):
id               323750 non-null int64
name             323746 non-null object
category         323745 non-null object
main_category    323750 non-null object
currency         323750 non-null object
deadline         323750 non-null object
goal             323750 non-null object
launched         323169 non-null datetime64[ns]
pledged          323750 non-null object
state            323750 non-null object
backers          323750 non-null object
country          323750 non-null object
usd_pledged      319960 non-null object
unm_1            625 non-null object
unm_2            12 non-null object
unm_3            4 non-null object
unm_4            1 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(14)
memory usage: 42.0+ MB

In [31]:
kick['launch_month'] = kick.launched.dt.month

### PROBLEM

Consider what other ways to use the dates to create new features.  Generate as many as you can think of and examine them in terms of our earlier feature selection methods.  Finally, compare the performance of five different classifiers using the selected features.

In [32]:
kick.head()

,id,name,category,main_category,currency,deadline,goal,launched,pledged,state,backers,country,usd_pledged,unm_1,unm_2,unm_3,unm_4,launch_month
0,1000002330,The Songs of Adelaide & Abullah,Poetry,Publishing,GBP,2015-10-09 11:36:00,1000,2015-08-11 12:12:28,0,failed,0,GB,0,NaN,NaN,NaN,NaN,8.0
1,1000004038,Where is Hank?,Narrative Film,Film & Video,USD,2013-02-26 00:20:50,45000,2013-01-12 00:20:50,220,failed,3,US,220,NaN,NaN,NaN,NaN,1.0
2,1000007540,ToshiCapital Rekordz Needs Help to Complete Album,Music,Music,USD,2012-04-16 04:24:11,5000,2012-03-17 03:24:11,1,failed,1,US,1,NaN,NaN,NaN,NaN,3.0
3,1000011046,Community Film Project: The Art of Neighborhoo...,Film & Video,Film & Video,USD,2015-08-29 01:00:00,19500,2015-07-04 08:35:03,1283,canceled,14,US,1283,NaN,NaN,NaN,NaN,7.0
4,1000014025,Monarch Espresso Bar,Restaurants,Food,USD,2016-04-01 13:38:27,50000,2016-02-26 13:38:27,52375,successful,224,US,52375,NaN,NaN,NaN,NaN,2.0

In [35]:
kick['deadline'] = pd.to_datetime(kick.deadline, errors = 'coerce')

In [36]:
kick.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 323750 entries, 0 to 323749
Data columns (total 18 columns):
id               323750 non-null int64
name             323746 non-null object
category         323745 non-null object
main_category    323750 non-null object
currency         323750 non-null object
deadline         323118 non-null datetime64[ns]
goal             323750 non-null object
launched         323169 non-null datetime64[ns]
pledged          323750 non-null object
state            323750 non-null object
backers          323750 non-null object
country          323750 non-null object
usd_pledged      319960 non-null object
unm_1            625 non-null object
unm_2            12 non-null object
unm_3            4 non-null object
unm_4            1 non-null float64
launch_month     323169 non-null float64
dtypes: datetime64[ns](2), float64(2), int64(1), object(13)
memory usage: 44.5+ MB

In [ ]:
#pledged by day?
#state by day?
#state by year?

In [37]:
kick.launched.dt.weekday_name

0           Tuesday
1          Saturday
2          Saturday
3          Saturday
4            Friday
5            Monday
6            Monday
7          Thursday
8            Friday
9            Monday
10         Saturday
11          Tuesday
12          Tuesday
13         Thursday
14         Thursday
15           Friday
16         Thursday
17         Thursday
18           Monday
19           Friday
20           Monday
21         Thursday
22          Tuesday
23           Sunday
24           Friday
25          Tuesday
26           Sunday
27        Wednesday
28         Thursday
29          Tuesday
            ...
323720    Wednesday
323721    Wednesday
323722     Saturday
323723       Sunday
323724    Wednesday
323725      Tuesday
323726     Thursday
323727       Monday
323728      Tuesday
323729       Monday
323730      Tuesday
323731      Tuesday
323732       Friday
323733       Monday
323734       Monday
323735       Monday
323736      Tuesday
323737       Friday
323738    Wednesday
323739       Sunday
323740       Friday
323741     Thursday
323742       Sunday
323743    Wednesday
323744    Wednesday
323745    Wednesday
323746    Wednesday
323747     Thursday
323748    Wednesday
323749      Tuesday
Name: launched, Length: 323750, dtype: object

In [ ]:
#length

In [38]:
kick.country.value_counts

<bound method IndexOpsMixin.value_counts of 0         GB
1         US
2         US
3         US
4         US
5         US
6         US
7         US
8         US
9         CA
10        US
11        US
12        US
13        US
14        US
15        US
16        US
17        US
18        US
19        US
20        NO
21        US
22        US
23        GB
24        CA
25        GB
26        GB
27        US
28        AU
29        US
          ..
323720    US
323721    FR
323722    US
323723    NL
323724    US
323725    US
323726    US
323727    US
323728    US
323729    CA
323730    US
323731    US
323732    US
323733    CH
323734    US
323735    US
323736    GB
323737    US
323738    US
323739    US
323740    US
323741    CA
323742    NO
323743    US
323744    CA
323745    US
323746    US
323747    US
323748    US
323749    US
Name: country, Length: 323750, dtype: object>

In [39]:
kick['launch_day'] = kick.launched.dt.weekday_name

In [41]:
kick['deadline_day'] = kick.deadline.dt.weekday_name

In [44]:
kick['launch_hour'] = kick.launched.dt.hour

In [46]:
kick.loc[:, 'length'] = kick.deadline - kick.launched

In [49]:
kick['deadline_week'] = kick.deadline.dt.week

In [60]:
kick['launch_week'] = kick.launched.dt.week

In [61]:
kick.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 323750 entries, 0 to 323749
Data columns (total 24 columns):
id               323750 non-null int64
name             323746 non-null object
category         323745 non-null object
main_category    323750 non-null object
currency         323750 non-null object
deadline         323118 non-null datetime64[ns]
goal             323750 non-null object
launched         323169 non-null datetime64[ns]
pledged          323750 non-null object
state            323750 non-null object
backers          323750 non-null object
country          323750 non-null object
usd_pledged      319960 non-null object
unm_1            625 non-null object
unm_2            12 non-null object
unm_3            4 non-null object
unm_4            1 non-null float64
launch_month     323169 non-null float64
launch_day       323169 non-null object
deadline_day     323118 non-null object
launch_hour      323169 non-null float64
length           323118 non-null timedelta64[ns]
deadline_week    323118 non-null float64
launch_week      323169 non-null float64
dtypes: datetime64[ns](2), float64(5), int64(1), object(15), timedelta64[ns](1)
memory usage: 59.3+ MB

In [64]:
kick.head()

,id,name,category,main_category,currency,deadline,goal,launched,pledged,state,...,unm_2,unm_3,unm_4,launch_month,launch_day,deadline_day,launch_hour,length,deadline_week,launch_week
0,1000002330,The Songs of Adelaide & Abullah,Poetry,Publishing,GBP,2015-10-09 11:36:00,1000,2015-08-11 12:12:28,0,failed,...,NaN,NaN,NaN,8.0,Tuesday,Friday,12.0,58 days 23:23:32,41.0,33.0
1,1000004038,Where is Hank?,Narrative Film,Film & Video,USD,2013-02-26 00:20:50,45000,2013-01-12 00:20:50,220,failed,...,NaN,NaN,NaN,1.0,Saturday,Tuesday,0.0,45 days 00:00:00,9.0,2.0
2,1000007540,ToshiCapital Rekordz Needs Help to Complete Album,Music,Music,USD,2012-04-16 04:24:11,5000,2012-03-17 03:24:11,1,failed,...,NaN,NaN,NaN,3.0,Saturday,Monday,3.0,30 days 01:00:00,16.0,11.0
3,1000011046,Community Film Project: The Art of Neighborhoo...,Film & Video,Film & Video,USD,2015-08-29 01:00:00,19500,2015-07-04 08:35:03,1283,canceled,...,NaN,NaN,NaN,7.0,Saturday,Saturday,8.0,55 days 16:24:57,35.0,27.0
4,1000014025,Monarch Espresso Bar,Restaurants,Food,USD,2016-04-01 13:38:27,50000,2016-02-26 13:38:27,52375,successful,...,NaN,NaN,NaN,2.0,Friday,Friday,13.0,35 days 00:00:00,13.0,8.0

In [48]:
from sklearn.feature_selection import RFE, SelectFromModel, SelectPercentile

In [51]:
from sklearn.ensemble import RandomForestClassifier

In [55]:
kick.state.value_counts()

failed                 168221
successful             113081
canceled                32354
live                     4428
undefined                3555
suspended                1479
0                          96
1                          15
5                          11
25                         11
10                         10
100                         8
50                          7
65                          6
2                           5
55                          5
110                         5
20                          5
35                          5
30                          4
21                          4
6                           4
150                         3
130                         3
90                          3
125                         3
200                         3
390                         3
1665                        2
11044                       2
                        ...
106                         1
2053                        1
2013-01-03 03:45:14         1
1397                        1
46653                       1
1085                        1
1600                        1
3065.7                      1
1495                        1
2759                        1
2531                        1
7703                        1
1301                        1
12201                       1
2016-02-22 21:57:30         1
4488.01                     1
1200                        1
82                          1
5556                        1
2721                        1
2742                        1
1595                        1
22                          1
8494                        1
6790                        1
5940                        1
1100                        1
25651.99                    1
10770                       1
1035                        1
Name: state, Length: 410, dtype: int64

In [57]:
dums = pd.get_dummies(kick.category, drop_first=True)

In [58]:
dums.shape

(323750, 769)

In [59]:
kick.launch_month.describe()

count    323169.000000
mean          6.443424
std           3.300204
min           1.000000
25%           4.000000
50%           7.000000
75%           9.000000
max          12.000000
Name: launch_month, dtype: float64

In [62]:
day_dum = pd.get_dummies(kick.launch_week)

In [63]:
kick.launch_week.describe()

count    323169.000000
mean         26.298562
std          14.372932
min           1.000000
25%          14.000000
50%          27.000000
75%          39.000000
max          53.000000
Name: launch_week, dtype: float64